from aiogram import html

# ======================================================================
# -----------------------------COMMON BLOCK-----------------------------
# ======================================================================

HELLO_TEXT = """👋 Привет!
Ты в умном боте для подготовки к ЕГЭ и ОГЭ математике.

Здесь ты сможешь:
✅ Проверить свои ответы.
✅ Получишь консультацию через кнопку «контакты»

🚀 Просто выберите номер варианта и отправь свой ответ — бот всё проверит!
И помни: каждая ошибка — это шаг к 100 баллам.

Готов проверить себя? Погнали! 🎯
"""


CONTACTS_TEXT = """Поддержка:

Присоединяйтесь к нашему Telegram-каналу:
@matnas7

💬 Если у вас есть вопросы или вам нужна помощь:
@NikitaAlekseevichh"""

CHOOSE_ROLE = "Кем вы являетесь?"

CHOOSE_OPTION = "Выберите одну из представленный ниже опций:"

NOT_STUDENT = "Вы не являетесь учеником.\nДля доступа к функционалу ученика передайте куратору свой телеграм-id ({}) и попросите добавить Вас."

NOT_TUTOR = "Вы не являетесь куратором.\nДля доступа к функционалу куратора обратитесь в поддержку."

MY_ID = "Ваш телеграм-id: {}"

UNKNOWN_COMMAND = "Неизвестная команда."

# ======================================================================
# -------------------------STUDENT (TASKS) BLOCK------------------------
# ======================================================================

YOUR_RESULT_NO_DATA = "Результат:"

YOUR_RESULT = "Ваш результат: {}/{}"

RESULT_LINE = "{}) {}\n"

TASK_NUMBER = "ЗАДАНИЕ №{}"

LINE_NUMBER = "НОМЕР №{}"

VARIANT_NUMBER = "ВАРИАНТ №{}"

AKS_CONTINUE = "Хотите продолжить подготовку?"

TEST_STOPPED = "Тест приостановлен."

CHOOSE_EXAM_TYPE = "Выберите тип экзамена:"

CHOOSE_PREPARATION_TYPE = "Выберите вид подготовки:"

CHOOSE_VARIANT_NUMBER = "Выберите номер варианта:"

CHOOSE_LINE_NUMBER = "Выберите номер задания:"

CHOOSE_TASKS_NUMBER = "Выберте число заданий:"

# ======================================================================
# ------------------------STUDENT (HOMEWORK) BLOCK----------------------
# ======================================================================

STUDENT_NOT_FOUND = "Пользователь не найден. Обратитесь в опддержку для решения проблемы."

CHOOSE_DATE = "Выберите дату задания:"

EMPTY = "Здесь пока ничего нет."

SUBMIT_HOMEWORK = f"""{html.bold("Важно:")}

Принимаются {html.bold("только фото с текстом")} в сообщении, файлы и прочите форматы будут проигнорированы;

Домашнее задание нужно отправить {html.bold("одним сообщением")}, все последующие сообщения будут также проигнорированы;

Домашнее задание {html.bold("позже будет нельзя отправить")} занаво или редактировать.

Отправьте домашнее задание:"""

TUTOR_COMMENT = "Комментарий куратора: \n\n{}"

EMPTY_TUTOR_COMMENT = "Куратор не оставил комментария."

HW_SUBMITTED_SUCCESS = "Домашнее задание успешно отправлено."

HW_SUBMITTED_FAILED = "Домашнее задание не было отправлено. Обратитесь в опддержку для решения проблемы."

# ======================================================================
# -------------------------STUDENT (PROFILE) BLOCK----------------------
# ======================================================================

EDIT_STUDENT_PROFILE = "Выберите данные для изменения:"

EDIT_STUDENT_NAME = "Введите ваше имя:"

EDIT_STUDENT_SURNAME = "Введите вашу фамилию:"

DATA_UPDATED_SUCCESS = "Данные успешно обновлены."

HOMEWORK_ALREADY_SET = "В Выбранный Вами день уже задано домашнее задание."

DATA_UPDATED_FAILED = "Не удалось обновить данные. Обратитесь в поддержку для решения проблемы."

PROFILE_TEXT = """Ваш профиль:

Имя: {}
Фамилия: {}
StudentID: {}

Последний пробник: {}
"""

# ======================================================================
# ---------------------------STUDENT (AI) BLOCK-------------------------
# ======================================================================

AI_ERROR = "Ошибка при подключении к ИИ. Для решения проблемы обратитесь в поддержку."

AI_STOP = "Чат с ИИ-ассистентом приостановлен."

AI_START = "Создан новый диалог с ИИ-ассистентом.\nНапишите свой запрос:"

LATEX_WARNING_AI = " В своем ответе ни в коем случае не используй разметку latex. Используй простой текст без использоания разметки latex."

# ======================================================================
# -----------------------------TUTOR (SK) BLOCK-------------------------
# ======================================================================

GEN_KEY = "Актуальный SK:\n\n{}"

INPUT_SK = "Для полного доступа введите SK:"

INPUT_SK_AGAIN = "Неверный SK. Попробуйте снова:"

# ======================================================================
# -----------------------------TUTOR (LESSONS) BLOCK-------------------------
# ======================================================================

LESSONS_LIST = """Все записи на занятие:

{}

Чтобы удалить запись, нажми на команду рядом с ней."""

LESSON_EMAIL = """/del_{}
{}

email: {}
username: {}"""

LESSON_OTHER_DATA = """/del_{}
{}

контакт: {}
username: {}"""

EMPTY_LESSONS_LIST = "Здесь пока нет записей."


# ======================================================================
# ------------------------TUTOR (HOMEWORK) BLOCK------------------------
# ======================================================================

CHOOSE_STUDENT = "Выберите ученика:"

SUBMIT_FEEDBACK = f"""{html.bold("Важно:")}

Принимаются {html.bold("только фото с текстом")} в сообщении, файлы и прочите форматы будут проигнорированы;

Ответ нужно отправить {html.bold("одним сообщением")}, все последующие сообщения будут также проигнорированы;

Ответ {html.bold("позже будет нельзя отправить")} занаво или редактировать.

Отправьте Ваш ответ:"""

TUTOR_SET_HOMEWORK = f"""{html.bold("Важно:")}

Принимаются {html.bold("только фото с текстом")} в сообщении, файлы и прочите форматы будут проигнорированы;

Задание нужно отправить {html.bold("одним сообщением")} (группа фотграфий + текст), все последующие сообщения будут также проигнорированы;

Задание {html.bold("позже будет нельзя отправить")} занаво или редактировать.

Отправьте задание:"""

STUDENT_COMMENT = "Комментарий ученика: \n\n{}"

EMPTY_STUDENT_COMMENT = "Ученик не оставил комментария."

# ======================================================================
# ------------------------TUTOR (STUDENT) BLOCK------------------------
# ======================================================================

SET_STUDENT_TELEGRAM_ID = f"""Введите телеграм-id ученика:

{html.italic("Чтобы узнать телеграм-id, используйте комманду /myid")}"""

INCORRECT_TELEGRAM_ID = """Неверный формат тегерам-id.
Телеграм-id дложно быть натуальным числом, не превосходящим 1e10."""

STUDENT_ADD_SUCCESS =  "Ученик успешно добавлен."

STUDENT_ADD_FAILED = "Не удалось добавить ученика. Для решения проблемы обратитесь в поддержку."

STUDENT_ALREADY_EXISTS = "Ученик с таким тг-ником уже добавлен."

STUDENT_DELETE_SUCCESS =  "Ученик успешно удален."

STUDENT_DELETE_FAILED = "Не удалось удалить ученика. Для решения проблемы обратитесь в поддержку."

STUDENT_PROFILE_TEXT = """Профиль ученика:

Имя: {}
Фамилия: {}
StudentID: {}

Последний пробник {}


Выберите данные для изменения:
"""

TUTOR_EDIT_STUDENT_NAME = "Введите имя ученика:"

TUTOR_EDIT_STUDENT_SURNAME = "Введите фамилию ученика:"

# ======================================================================
# -------------------------TUTOR (STUDENT) BLOCK------------------------
# ======================================================================

UPDATE_PROBE_RESULT = f"Введите резльутат последнего пробника ученика:\n\n{html.italic("Резльтат должен быть натуральным числом.")}"

INCORRECT_FORMAT_RESULT_PROBE = "Некорректный формат ввода результата пробника. Результат должен быть натуральным числом, не превосходящим 1000."

# ======================================================================
# -------------------------------PARENT BLOCK---------------------------
# ======================================================================

PARENT_INPUT_STUDENT_ID = "Введите StdentID ученика:"

INCORRECT_STUDENT_ID = "Ученик с таким StudentID не найден."

INPUT_EMAIL = "Введите свою электронную почту:"

INPUT_CONTACT_DATA = "Введите данные для связи:"

INCORRECT_EMAIL = "Введенные данные не соответствуют формату электронной почты.\nПопробуйте снова:"

INCORRECT_CONTACT_DATA = "Длина введенных данных не должна превышать 80 символов.\nПопробуйте снова:"

LESSON_ADD_SUCCESS = "Запись успешно добавлена. Ожидайте письма на электронной почте или и не забывайте проверять спам."

LESSON_ADD_FAILED =  """Не удалось добавить запись.

Просим обратить внимание, что на одну почту в день можно отправлять не более одного запроса на запись.

Если Вы сегодня еще не добавляли запись на указанную почту, то для решения проблемы обратитесь к поддрежку."""


PARENT_STUDENT_PROFILE_TEXT = STUDENT_PROFILE_TEXT = """Профиль ученика:

Имя: {}
Фамилия: {}
StudentID: {}

Последний пробник: {}
"""
